# PointLoadType Class (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
PointLoadType Class
Members See Also
---
An object that represents a Load type.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public class PointLoadType : LoadTypeBase
```

Visual Basic
---
```text
Public Class PointLoadType _
	Inherits LoadTypeBase
```

Visual C++
---
```text
public ref class PointLoadType : public LoadTypeBase
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Structure..::..LoadTypeBase Autodesk.Revit.DB.Structure..::..PointLoadType
# See Also
PointLoadType Members
Autodesk.Revit.DB.Structure Namespace